// Напишете програма която да извършва следните операции :
// - при въвеждане на четно число да бибитка 2 пъти
// - при въвеждане на нечетно число да бибитка 3 пъти.
// - Да определи остатъка от делението на - .
// При остатък по - голям от 3 да сумира числото и остатъка.В противен случай от числото да се извади остатъка.

#include <iostream>
#include <stdio.h>

int main()
{
    int a, b, result;

    scanf_s("%d", &a);
    scanf_s("%d", &b);


    result = a / b;

    if (result) {
        printf("\a\a", result);
    }
    else {
        printf("\a\a\a", result);
    }

    return 0;
}