// Напишете програма която да извършва следните операции :
// - да се въведат две цели числа;
// - да се разделят двете числа;
// - да се опреди остатъка и от целочисленото им деление
// - ако резултатът от делението е точно число да се изведе на екрана.В противен случай да се изведе съобщението “Двете числа не се делят точно”

#include <iostream>
#include <stdio.h>

int main()
{
    int a, b, result;

    scanf_s("%d", &a);
    scanf_s("%d", &b);

    result = a / b;

    if (result) {
        printf("%d", result);
    }
    else {
        printf("Ne e tochno delenie.");
    }

    return 0;
}