// Напишете програма която да извършва следните операции :
// - Въвеждане на  две цели числа от клавиатурата;
// - Сравняване на числата и се извежда по - малкото от двете;
// - Извеждане на резултата в дясно подравнен формат;
// - Извеждане на резултата в шестнадесетичен вид;
// - Въвеждане на две реални числа. Да се изведе по - голямото от двете числа.

#include <iostream>
#include <stdio.h>

int main()
{
    int a, b;
    float c, d;

    scanf_s("%d", &a);
    scanf_s("%d", &b);

    if (a > b) {
        printf("%20d", b);
        printf("%X", b);
    }
    else {
        printf("%20d", a);
        printf("%X", a);
    }

    scanf_s("%f", &c);
    scanf_s("%f", &d);

    if (c > d) {
        printf("%20f", c);
        printf("%X", c);
    }
    else {
        printf("%20f", d);
        printf("%X", d);
    }

    return 0;
}